       IDENTIFICATION DIVISION.
       PROGRAM-ID. AOC-2022-2.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
           FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO "inputs/day2.txt"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE.
       01 SCORE-LINE PIC X(3).
       WORKING-STORAGE SECTION.
       01 STATE.
         05 WS-FINISHED PIC X VALUE "N".
         05 WS-SCORE-1 PIC 9 USAGE COMP.
         05 WS-SCORE-2 PIC 9 USAGE COMP.
         05 WS-TOTAL-SCORE-1 PIC 9(7) VALUE 0.
         05 WS-TOTAL-SCORE-2 PIC 9(7) VALUE 0.
       PROCEDURE DIVISION.
       MAIN.
           OPEN INPUT INPUT-FILE.
           PERFORM PROCESS-DATA UNTIL WS-FINISHED = "Y".
           STOP RUN.
       PROCESS-DATA.
           READ INPUT-FILE AT END PERFORM FINISH.

           INSPECT SCORE-LINE CONVERTING "XAYBZC" TO "001122".
           UNSTRING SCORE-LINE DELIMITED BY SPACE INTO WS-SCORE-1
           WS-SCORE-2 END-UNSTRING.

           EVALUATE TRUE
               WHEN WS-SCORE-1 = WS-SCORE-2
                   ADD 3 TO WS-TOTAL-SCORE-1
               WHEN WS-SCORE-1 = FUNCTION MOD(WS-SCORE-2 + 1, 3)
                   ADD 0 TO WS-TOTAL-SCORE-1
               WHEN WS-SCORE-1 = FUNCTION MOD(WS-SCORE-2 + 2, 3)
                   ADD 6 TO WS-TOTAL-SCORE-1
           END-EVALUATE.

           COMPUTE WS-TOTAL-SCORE-1 = WS-TOTAL-SCORE-1 + FUNCTION
           MOD(WS-SCORE-2, 3) + 1.

           COMPUTE WS-TOTAL-SCORE-2 = WS-TOTAL-SCORE-2 + FUNCTION
           MOD((WS-SCORE-1 + (FUNCTION MOD (WS-SCORE-2 + 1, 3)) ) + 1,
           3) + 1 + (WS-SCORE-2 * 3).

       FINISH.
           MOVE "Y" TO WS-FINISHED.
           DISPLAY "Task 1 " WS-TOTAL-SCORE-1.
           DISPLAY "Task 2 " WS-TOTAL-SCORE-2.
           CLOSE INPUT-FILE.
