       IDENTIFICATION DIVISION.
       PROGRAM-ID. AOC-2022-X.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
           FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO "inputs/dayX.txt"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
           FD INPUT-FILE.
           01 INPUT-STRING PIC X(9).
       WORKING-STORAGE SECTION.
       01 STATE.
         05 FINISHED PIC X VALUE "N".
       PROCEDURE DIVISION.
       MAIN.
           OPEN INPUT INPUT-FILE.
           PERFORM PROCESS-DATA UNTIL FINISHED = "Y".
           STOP RUN.
       PROCESS-DATA.
           READ INPUT-FILE AT END PERFORM FINISH.
       FINISH.
           CLOSE INPUT-FILE.
           MOVE "Y" TO FINISHED.
